//
//  Interview.swift
//  TaxReader
//
//  Created by asdc on 2020/7/31.
//  Copyright © 2020 TongFangXL. All rights reserved.
//

/*
    
    
    
    求职意向：iOS开发工程师   工作经验：4年(iOS开发)
    
    姓 名：谢磊                                     性 别：男
    学历：全日制本科                                 专 业：计算机专业
    联系方式：157-1135-1029                            常用邮箱：15711351029@163.com
    
    同方鼎欣科技股份有限公司，iOS开发组组长 --- 2016.02 - 至今
    工作描述：
    1、参与初期产品设计并完成相关开发文档
    2、根据业务需求，基于iOS平台进行应用程序开发。
    3、负责项目开发过程中与相关人员的沟通与协调，跟进项目的开发进度。
    
    北京励航教育科技发展有限公司，iOS软件开发工程师 --- 2015.03 - 2015.12
    工作描述：
    1、主要负责公司项目励航儿童卫士和励航微校iOS客户端的开发工作
    2、开发过程中部分技术点的实现，协助API开发人员接口定制。
    
    2017.4 – 2018.9 富士打印
    项目状态：已上线(目前迭代到三期)
    项目职责：
    1、项目负责人。项目开发计划制定，及完成项目中主要开发及更新维护。
    2、学习硬件厂商提供的打印机示例代码和富士总公司提供的图片美肌处理技术并应用到本项目中
    项目描述：本产品是受富士胶片(中国)投资有限公司委托开发的一款可连接打印机进行照片打印的工具，通过WiFi或路由模式连接打印机后，从相机相册或SD卡获取照片，可选多种不同的打印的方式。
    项目地址：https://itunes.apple.com/cn/app/fu-shi-da-yin/id1232129303?mt=8
    配套打印机淘宝售货地址：http://www.dwntme.com/h.ZYov3S0
    应用技术：
    1、使用Photos框架来获取相册中的图片作为数据源
    2、对图片的编辑操作，包括多比例裁剪、滤镜(GPUImage)、饱和度调节、贴纸功能等。
    3、参考美图秀秀示例完成证件照拼图的尺寸计算及添加裁切线
    4、使用coreImage和OpenCV替换证件照背景颜色
    5、使用sqlite数据库后期集成使用MTA，统计用户使用信息并上传。
    6、前期集成使用bugly收集崩溃信息，后期使用原生代码获取崩溃日志并上传。
    7、使用Instruments工具对项目中的内存泄漏进行检测并处理，线上根据DYSM分析内存地址定位崩溃。
    8、使用富士生产的打印机对处理后的图片进行单张或多张打印
    2018.1 - 2018.5 视频监控
    项目状态：企业账号发布
    项目职责：项目迭代版本开发，负责与相关技术支持人员沟通协调及对新功能的调研
    项目描述：本产品是受中国移动通信研究院委托新功能开发，整合不同级别设备所有时段监控得到的视频数据，直播摄像头获取到的视频流并截图录屏，回看历史有监控数据的时段并可选播放，软硬件交互，可查看和修改个人信息、查看摄像头详情及修改相关设置信息等
    网盘截图：https://pan.baidu.com/s/1dGSQSbJ
    应用技术：
    1、直播，播放rtsp协议的视频流并能截屏和录制
    2、回看，播放摄像头监控得到的m3u8格式视频并交互
    3、长连接及粘包处理，摄像头告警信息的本地推送
    4、控制视频播放，时间轴显示有视频区域并能拖动跳转到有视频段播放
    5、日历使用，只显示月份中有数据能点击操作的日期
    6、设备级别，采用树形结构显示并可操作选择全部设备的等级
    
    2017.10 - 2017.12 中国教育电视台E平台
    项目状态：已上线
    项目职责：项目负责人。项目开发计划制定，及项目中主要技术支持
    项目描述：本产品是受中国教育电视台委托开发，E平台建设主要是基于电视台融合媒体技术架构，整合台内及网络上的资源，实现全媒体内容汇聚。项目按栏目新闻、地区新闻、我的订阅、我的项目进行分类，以最新最热标签列表显示新闻内容，对稿件内容展开阅读，视频内容播放收看。
    项目地址：https://itunes.apple.com/us/app/jiao-yu-e-ping-tai/id1334498866?l=zh&ls=1&mt=8
    平台地址：http://172.25.78.211:8081/cetvep/login.html
    应用技术：
    1、集成使用极光推送
    2、地区新闻中省市单位的本地化搜索
    3、使用AVPalyer完成稿件详情中的视频播放
    
    2016.11 - 2017.4 大马力(包含货主端和司机端)
    项目状态：已上线
    项目描述：
    货主端：本产品是受北京智运道通科技有限责任公司委托开发，为货主用户提供的一款发布订单的工具，与平台端交互完成订单的在线发布。包括我的订单、司机已抢单、钱包、设置及个人模块。
    司机端：本产品是受北京智运道通科技有限责任公司委托开发，为广大货运司机提供的一款在线抢单的工具。包括抢单、我的订单、车辆、钱包、设置及个人模块。
    智运道通官网：http://www.zhiyundaotong.com
    智运道通平台：http://115.28.243.13:8081/zydt-web/adminLogin/login.do
    货主端地址：https://itunes.apple.com/cn/app/da-ma-li-huo-zhu-duan/id1151753446?mt=8
    司机端地址：https://itunes.apple.com/cn/app/da-ma-li-si-ji-duan/id1151763437?mt=8
    项目职责：个人独立完成货主端和司机端的开发
    应用技术：
    1、集成使用友盟推送，支付宝、微信、银联支付
    2、集成使用百度地图的定位、反地理编码、自定义大头针等功能
    3、app内嵌html，截获web页面的alert并优化弹窗，加强了web页与原生app的交互
    2016.5 - 2016.10 金管通(包括普查版和专查版)
    项目状态：已上线
    项目描述：
    普查版：本产品是受北京市金融工作局委托开发，进行互联网金融风险专项整治的排查摸底工具，起到搭建互联网金融机构与监管机构沟通桥梁的作用。包含待办任务、已办任务、隐患上报、系统设置模块。
    专查版：本产品是受北京市金融工作局委托开发，方便会计师、审计师、律师等专业人士根据重点关注风险点、有序地收集、识别、整合企业风险的相关信息，完成互联网金融风险专项整治的排查摸底。
    金管通平台：http://114.113.112.55:8082/login
    普查版地址：https://itunes.apple.com/cn/app/jin-guan-tong-pu-cha-ban/id1124703377?mt=8
    专查版地址：https://itunes.apple.com/cn/app/jin-guan-tong-zhuan-cha-ban/id1147503758?mt=8
    项目职责：个人独立完成普查版和专查版的开发
    应用技术：
    1、列表中数据的单选或多选操作折叠展开功能
    2、多张图片的预览删除，多张图片信息有序的上传下载
    3、语音信息的录制和播放，多条列表展示并能进行上传下载
    4、集成使用百度地图的定位、反地理编码，点聚合等功能
    5、使用AFNetworking来支持HTTPS并为项目对自签名证书做了技术支持
    
    2015.10 - 2015.12 励航微校
    项目状态：企业账号发布
    项目职责：独立完成整个项目的设计、开发和发布
    项目描述：这是一个基于公司所拥有的web端微校云交互管理系统所设计的信息展示性平台，会员机构管理者登录成功后，能对自己学校内班级、学生、教师等信息进行查看，并结合学生佩戴的智能手表，准确定位学生的位置信息、查看历史轨迹等。
    应用技术：
    1、使用第三方极光实现公告通知的远程推送
    2、高德地图的使用来实现定位功能，自定义大头针和历史轨迹的回放
    3、Charts报表的应用，实现财务流水在不同时段数据的自主查询展示
    4、调用系统打电话功能，相机相册的使用实现头像的自定义并存储到本地
     
    2015.3 - 2015.10励航儿童卫士
    项目状态：企业账号发布
    项目职责：设计及开发该项目主页、历史轨迹、设置等核心模块，验证并修正测试中发现的问题
    项目描述：这是一款针对儿童与家长设计的软硬件相结合的产品，通过佩戴在孩子身上的手表和这款应用相关联，能准确定位孩子所在的位置信息，设置相关手表的参数信息。
    应用技术：
    1、软硬件相结合，根据串号对相应手表功能的属性进行设置
    2、使用高德地图快速准确的定位孩子的位置，并提供手表的当前运行状态
    3、使用AFNetWorking对Xml数据的解析
    4、日历的使用，灵活选择了要查询轨迹的日期
    5、设置亲情号码，拨打对应手表上的电话号码
    6、使用通知中心，监听手表位置及电量等状态
    7、使用FMDB第三方进行数据库的数据管理操作
    
    1、精通Objective-C，熟悉Swift，了解PHP
    2、熟悉Xcode开发环境，能快速诊断和调试
    3、有良好的代码规范，重视代码的复用和可维护性
    4、对面向对象编程和MVC框架有深入理解
    5、熟悉OC的Runtime运行机制和内存管理机制
    6、熟练掌握SDK适配和屏幕适配
    7、既能用纯代码开发项目，也可以使用Storyboard/Xib辅助开发
    8、能根据需要定制复杂的UI控件及各功能模块的封装
    9、Json/Xml数据的解析主要使用AFNetworking框架
    10、熟练掌握常用的几种数据存储方式，如fmdb、plist、归档等
    11、熟练使用KVO、delegate、block、NSNotification等消息机制
    12、掌握NSThread、NSOperation、GCD(常用)多线程编程技术
    13、做过多媒体应用开发，如图像处理(富士打印)/视频相关(视频监控)
    14、集成使用过百度地图、友盟推送、微信支付、支付宝等常见三方框架
    15、App中内嵌html并进行数据交互
    16、合作开发目前主要使用Git以前多使用SVN
    17、熟悉App Store上线流程和常见被拒原因以及解决方案
    18、很强的学习能力，阅读英文开发文档，并善用CocoaChina/GitHub等网站
    
    2011.09 - 2015.7   平顶山学院   计算机科学与技术专业   本科
    对于iOS开发，我是真正地热爱！
    对待工作，我认真负责；对人对生活，我厚道我积极向上。
    集体荣誉感强，具备良好的沟通协调能力，对工作和团队尽职尽责。
    能快速适应新技术，并不断从新技术中学习提升自己，融会贯通地应用到工作中。
 
    谢磊简历
    求职意向：iOS 开发工程师  工作经验：5年（iOS开发）
    基本信息
    姓 名：谢磊                         性 别：男
    学 历：全日制本科                 专 业：计算机科学与技术
    联系电话：157-1135-1029             电子邮箱：15711351029@163.com
    专业技能
    1、具有扎实的Objective-C / Swift语言基础，较强的分析和解决问题能力。
    2、熟悉主流框架和设计模式，熟悉Git / SVN、CocoaPods、Xcode及调试工具。
    3、理解iOS的运行时，内存管理、多线程、消息循环、事件响应链、性能优化。
    4、熟练UI控件封装，熟悉网络编程、JSON/XML数据解析、数据存储知识。
    5、熟悉各种主流手机特性，熟悉不同iOS系统版本、屏幕的适配。
    6、既能用纯代码开发，也可以使用Storyboard / Xib辅助开发。
    7、做过多媒体应用开发，如图像处理（富士打印）/ 视频相关（视频监控）
    8、熟悉App Store上线流程和常见被拒原因以及解决方案
    工作经历
    同方鼎欣科技股份有限公司，iOS开发负责人 --- 2016.02 - 至今
    1、参与初期产品设计并完成相关开发文档
    2、根据业务需求，基于iOS平台进行应用程序开发。
    3、负责项目开发过程中与相关人员的沟通与协调，跟进项目的开发进度。

    北京励航教育科技发展有限公司，iOS开发工程师 --- 2015.07 - 2016.1
    1、主要负责公司产品励航儿童卫士和励航微校iOS客户端的开发维护工作
    2、开发过程中部分技术点的实现，配合测试人员进行测试。


    项目经验
    项目一 富士打印
    项目状态：已上线 App Store
    项目地址：https://itunes.apple.com/cn/app/fu-shi-da-yin/id1232129303?mt=8
    项目描述：
     一款可连接打印机进行照片打印的工具，通过WiFi或路由模式连接打印机后，从相机相册或SD卡获取照片，可选多种不同的打印方式。
    个人职责：
         团队主力开发，对接硬件厂商提供的打印机操作代码和图片美肌处理技术并应用，完成一般打印模块（图片编辑），证件照模块（多种尺寸，裁切线），模板打印模块（贴纸文字）等相关功能。及项目升级，团队攻坚，技术支持等。
    应用技术：
    1、使用 Photos 框架获取相册中的图片作为数据源
    2、图片编辑，包括多比例裁剪、滤镜（GPUImage）、贴纸文字等
    3、使用 coreImage 和 OpenCV 替换证件照背景颜色
    4、线上根据 DYSM 分析内存地址定位闪退

    项目二 视频监控
    项目状态：企业账号发布
    项目描述：整合不同级别设备所有时段监控得到的视频数据，直播摄像头获取到的视频流并截图录屏，回看历史有监控数据的时段并可选播放，软硬件交互，查看摄像头详情。
    个人职责：团队主力开发，在原有功能的基础上进行迭代，加载设备列表页，直播模块（截屏、录制），回看模块（视频播放，交互），树状图模块（设备等级）等相关功能。
    应用技术：
    1、直播（vlc + rtsp）+ 回看（AVPalyer）
    2、语音的录制和播放，多个图片和语音文件的上传下载
    3、长连接（AsyncSocket）及粘包处理，摄像头告警信息的本地推送


    项目三 教育E平台
    项目状态：已上线 App Store
    项目地址：https://itunes.apple.com/cn/app/jiao-yu-e-ping-tai/id1334498866?l=en
    项目描述：基于电视台融合媒体技术架构进行平台建设，整合台内及网络上的资源，实现全媒体内容汇聚与资源共享。
    个人职责：独立开发，完成开发文档的撰写，项目功能点的开发，负责应用的上线及后期维护。
    应用技术：
    1、集成友盟推送，支付宝、微信、银联支付
    2、使用百度地图的定位、点聚合、自定义大头针等功能
    3、通过AFNetworking使用自签名证书实现HTTPS请求

    项目四 励航儿童卫士
    项目状态：企业账号发布
    项目描述：这是一款针对儿童与家长设计的软硬件相结合的产品，通过佩戴在孩子身上的手表和这款应用相关联，能准确定位孩子所在的位置信息，打电话，设置相关手表的参数信息。
    个人职责：主要实现该项目主页、历史轨迹等核心模块，验证并修正测试中发现的问题。
    应用技术：
    1、xml数据，根据串号对手表的相应功能进行设置
    2、Charts报表的应用，实现流水在不同时段的自主查询
    教育经历
    2011.09 - 2015.7  平顶山学院  计算机科学与技术专业  本科
    个人评价
    对待工作，认真踏实；对待生活，积极向上。
    热爱开发学习，常逛CocoaChina / GitHub等技术社区，乐于分享技术沉淀，拓展技能树，成为更好的自己。
*/

/*

 熟悉并掌握Objective-C， Swift编程， 熟悉Cocoa语法特性
 熟悉iOS网络、内存管理、异步编程、runtime等技术●
 掌握常用设计模式，移动端架构设计，重构技巧@
 熟悉网络通信机制及常用的数据传输协议●
 掌握常用数据结构，算法设计
 可以使用Python，Shell，AppleScript等脚本语言编写基础脚本工具·
 有一定的蓝牙，音视频播放经验·
 善于总结，喜欢分享，将多种工作中遇到的问题进行汇总分析，输出成博客
 有较强的英文阅读能力和学习能力，曾翻译过多篇英文博客
 
    专业技能
    熟悉并掌握Objective-C，Swift编程，了解Flutter
    熟悉iOS网络、内存管理、异步编程、runtime等技术
    掌握常用设计模式，移动端架构设计，重构技巧
    熟悉网络编程、数据处理及存储，熟练控件封装页面定制
    熟悉常用数据结构，算法设计
    有一定的蓝牙，音视频播放经验
    熟悉主流手机特性，熟悉不同iOS系统版本、屏幕的适配
    熟悉App Store上线流程和常见被拒原因以及解决方案
    擅于总结，将工作中遇到的问题进行汇总分析
    
    工作经历
    同方鼎欣科技股份有限公司，iOS开发负责人 --- 2016.02 - 至今
    参与初期产品设计并完成相关开发文档
    根据业务需求，基于iOS平台进行应用程序开发
    负责项目开发过程中与相关人员的沟通与协调，跟进项目的开发进度

    北京励航教育科技发展有限公司，iOS开发工程师 --- 2015.07 - 2016.1
    主要负责公司产品励航儿童卫士和励航微校iOS客户端的开发和维护
    开发过程中部分技术点的实现，配合人员进行测试
 
    项目经验
    项目一 富士打印
    状态：已上线 App Store
    地址：https://itunes.apple.com/cn/app/fu-shi-da-yin/id1232129303?mt=8
    2017年为推广销售硬件产品小俏打印机，配套开发的一款可通过WiFi或路由模式连接并进行照片打印的应用。目前迭代到了第四版，随着固件版本和打印机的升级，淘宝的订单量也在快速持续的增长。
    项目任务：
    对接硬件厂商提供的打印机操作代码并应用
    使用 Photos 框架来获取相册中的图片作为数据源
    完成图片编辑模块，涉及多比例裁剪，滤镜处理使用GPUImage，实现类似美图秀秀的文字贴纸功能
    使用 coreImage 和 OpenCV 来证件照的背景颜色进行替换
    使用sqlite数据库后期集成使用MTA，统计用户使用信息并上传
    前期集成使用bugly收集崩溃信息，后期使用原生代码获取崩溃日志并上传
    使用Instruments工具对项目中的内存泄漏进行检测并处理，线上根据DYSM分析内存地址定位闪退，crash率从1.5%降到0.3%
 
    项目二 视频监控
    状态：企业账号发布
    摄像头种类样式变得多样化，原有应用功能单一不能满足继续交互，在整合了摄像头后台接收数据后，对项目进行重新设计和版本升级。做到直播摄像头获取到的视频流，回看历史有监控数据的时段并可选播放，软硬件交互，内部用户更易查看摄像头采集得到的监控数据。
    项目任务：
    独立开发迭代功能，完成了多种设备不同模式下的切换和显示
    直播模块，包含截屏和录制，采用vlc播放rtsp协议的视频流
    回看模块，重构播放器，由AVPlayer换成IJKPlayer，对m3u8格式的视频进行播放及交互
    树状图部分，不同设备多种等级的选择操作
    监控得到数据的长连接采用AsyncSocket进行通信并做粘包处理
  
    项目三 税刊阅读
    状态：已上线 App Store
    地址：https://apps.apple.com/cn/app/id1445109538
    一款税务期刊在线阅读平台，集纳了多年的税务研究的数据化内容资源，拥有阅读类产品的多数功能，完成线上的阅读，收藏及购买，先前纸质版的期刊现在也能拥有良好的在线阅读体验，在我经手项目不到一年的时间里，成交额也有曲线式的上升。
    项目任务：
    将原来的OC项目重构为Swift
    整合设计原有的分享，支付，购物车，夜间主题模块
    富文本资讯的阅读，结合使用WKWebview，对文章内的标签内容进行响应处理
    应用包体积减小实践，涉及图片压缩和无用代码清除，缩减了10M
    启动优化实践，应用二进制重排和非必要启动初始化方法后移，启动时间缩减了20%
 
    项目四 智运道通
    状态：已上线 App Store
    司机端地址：https://itunes.apple.com/cn/app/da-ma-li-si-ji-duan/id1151763437?mt=8
    货主端地址：https://itunes.apple.com/cn/app/da-ma-li-huo-zhu-duan/id1151753446?mt=8
    包含货主端和司机端，货主的产品经在线下单后，需要交付到客户手中，经货主端发布订单信息后，司机抢单，完成运输，途中能查看到相应货物的物流信息。司机端，查看已审核车辆附近的可抢订单信息，经在线抢单后，在规定的时间内到货物地点进行取货及运输，两个端的交互式操作，保证货物的通畅运输。
    项目任务：
    集成使用友盟推送，支付宝、微信、银联支付
    集成使用百度地图的定位、反地理编码、自定义大头针等功能
    对语音的录制和播放，对多张图片和录音文件的上传下载
    app内嵌html，截获网页的alert并优化弹窗，加强了web页与原生app的交互
 
    项目五 励航儿童卫士
    状态：企业账号发布
    一个定位于儿童与家长设计的软硬件结合的产品，通过佩戴在孩子身上的手表和这款应用相关联，类似小天才电话手表。差异化功能：日常提醒，家庭成员绑定，定位数据的回放，栅栏提醒等功能。负责开发主页、历史轨迹，提醒等核心模块。过程中，对xml数据处理，根据串号对手表的相应功能进行设置；Charts报表的应用，实现流水在不同时段的自主查询。为后续对平台系统的开发打好了数据基础。
 
    教育经历
    2011.09 - 2015.7  平顶山学院  计算机科学与技术专业  本科
    个人评价
    对待工作，认真踏实；对待生活，积极向上。
    热爱开发学习，常逛CocoaChina / GitHub等技术社区，乐于分享技术沉淀，拓展技能树，成为更好的自己。

 */
